# Feature Transformation

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('supershops.csv')

In [ ]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [ ]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        50 non-null     float64
 3   Area             50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [ ]:
df.Transport.fillna(df.Transport.mean(), inplace=True)

In [ ]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

In [ ]:
df.Transport

0     471784.100000
1     443898.530000
2     407934.540000
3     383199.620000
4     366168.420000
5     362861.360000
6     127716.820000
7     323876.680000
8     311613.290000
9     304981.620000
10    229160.950000
11    249744.550000
12    249839.440000
13    252664.930000
14    256512.920000
15    261776.230000
16    264346.060000
17    282574.310000
18    294919.570000
19    215331.732449
20    298664.470000
21    299737.290000
22    303319.260000
23    304768.730000
24    140574.810000
25    137962.620000
26    134050.070000
27    353183.810000
28    118148.200000
29    107138.380000
30     91131.240000
31     88218.230000
32     46085.250000
33    214634.810000
34    210797.670000
35    205517.640000
36    201126.820000
37    197029.420000
38    185265.100000
39    174999.300000
40    172795.670000
41    164470.710000
42    148001.110000
43     35534.170000
44     28334.720000
45      1903.930000
46    297114.460000
47         0.000000
48         0.000000
49     45173.060000
Name: Transport, dtype: float64

In [ ]:
df.Transport.mean()

215331.73244897963

In [ ]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()

# Normalization

In [ ]:
from sklearn.preprocessing import MinMaxScaler

In [ ]:
m = MinMaxScaler(feature_range=(0,1))

In [ ]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [ ]:
ms = m.fit(df[['Marketing Spend']])
ms

MinMaxScaler()

In [ ]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [ ]:
df['Marketing Spend'] = ms.transform(df[['Marketing Spend']])

In [ ]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [ ]:
df['Administration'] = m.fit_transform(df[['Administration']])

In [ ]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [ ]:
import numpy as np

In [ ]:
for x in df:
    if df.dtypes[x] == np.float64:
        df[x] = m.fit_transform(df[[x]])
    else:
        pass


df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        0.651744   1.000000    Dhaka  1.000000
1         0.983359        0.761972   0.940893      Ctg  0.997355
2         0.927985        0.379579   0.864664  Rangpur  0.993178
3         0.873136        0.512998   0.812235    Dhaka  0.947292
4         0.859438        0.305328   0.776136  Rangpur  0.853171

# Standardization

In [ ]:
from sklearn.preprocessing import StandardScaler

In [ ]:
sc = StandardScaler()

In [ ]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [ ]:
for x in df1:
    if df1.dtypes[x] == np.float64:
        df1[x] = sc.fit_transform(df1[[x]])
    else:
        pass


df1.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.897913        0.560753   2.187271    Dhaka  2.011203
1         1.955860        1.082807   1.949436      Ctg  1.999430
2         1.754364       -0.728257   1.642701  Rangpur  1.980842
3         1.554784       -0.096365   1.431738    Dhaka  1.776627
4         1.504937       -1.079919   1.286479  Rangpur  1.357740

# Robust Scaler

In [ ]:
from sklearn.preprocessing import RobustScaler

In [ ]:
rc = RobustScaler()

In [ ]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [ ]:
for x in df2:
    if df2.dtypes[x] == np.float64:
        df2[x] = rc.fit_transform(df2[[x]])
    else:
        pass


df2.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.672530        0.345355   1.561661    Dhaka  1.698340
1         1.452113        0.697565   1.392082      Ctg  1.688874
2         1.303634       -0.524290   1.173378  Rangpur  1.673929
3         1.156567       -0.097977   1.022959    Dhaka  1.509736
4         1.119836       -0.761543   0.919389  Rangpur  1.172943

# Max Absolute Scaler

In [ ]:
from sklearn.preprocessing import MaxAbsScaler

In [ ]:
mas = MaxAbsScaler()

In [ ]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [ ]:
for x in df3:
    if df3.dtypes[x] == np.float64:
        df3[x] = mas.fit_transform(df3[[x]])
    else:
        pass


df3.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        0.749527   1.000000    Dhaka  1.000000
1         0.983359        0.828805   0.940893      Ctg  0.997557
2         0.927985        0.553781   0.864664  Rangpur  0.993699
3         0.873136        0.649738   0.812235    Dhaka  0.951317
4         0.859438        0.500378   0.776136  Rangpur  0.864383

In [ ]:
from pandas.core.dtypes.common import is_numeric_dtype

In [ ]:
for x in df4.columns:
    if is_numeric_dtype(df4[x]):
        df4[x] = rc.fit_transform(df4[[x]])
    else:
        continue
df4.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.672530        0.345355   1.561661    Dhaka  1.698340
1         1.452113        0.697565   1.392082      Ctg  1.688874
2         1.303634       -0.524290   1.173378  Rangpur  1.673929
3         1.156567       -0.097977   1.022959    Dhaka  1.509736
4         1.119836       -0.761543   0.919389  Rangpur  1.172943